app/controllers/conversations_controller.rb

SELECT "conversations".* FROM "conversations"
---
  def index
    @conversations = Conversation.all

INSERT INTO "conversations" ("title", "body", "notes", "solved", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
---
  def create
    @conversation = Conversation.new(conversation_params)

    if @conversation.save

UPDATE "conversations" SET "solved" = $1, "updated_at" = $2 WHERE "conversations"."id" = $3  [["solved", false], ["updated_at", "2020-04-25 00:40:50.973059"], ["id", 1]]
---
  def update
    if @conversation.update(conversation_params)

DELETE FROM "conversations" WHERE "conversations"."id" = $1  [["id", 1]]
---
  def destroy
    @conversation.destroy

SELECT  "conversations".* FROM "conversations" WHERE "conversations"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def set_conversation
    @conversation = Conversation.find(params[:id])